const bookContentElement = document.getElementById('book-content');
const bookText = `
	<p><h1>Прекрастная ведьма <br>Глава 1</h1></p>
	<p>На паре было ужасно скучно.

Настолько, насколько может быть скучным едва слышное бормотание засыпавшего за кафедрой престарелого преподавателя, который со дня на день собирался уйти на заслуженный отдых. Предмет не был профильным, а потому особого интереса не вызывал, а зачет обещал быть легким. Хотелось спать, потому что в потоковой аудитории было еще и холодно – что-то случилось с отоплением, и мы уже вторую неделю занимались в куртках, а кто-то даже не снимал шапки.

Я сидела за четвертой партой, по привычке выпрямив спину и делая вид, что внимательно слушаю, но глаза то и дело закрывались, а голова так и норовила упасть на плечо. Шел шестой час вечера, и нестерпимо хотелось домой. Я бы многое отдала, чтобы оказаться сейчас в уютной кухне с теплым пледиком, чашкой горячего какао и новой серией любимого сериала, однако приходилось вслушиваться в бормотание профессора, время от времени зябко передергивая плечами.

Субботний день и шестая пара плохо сочетались друг с другом. И кто только составил такое расписание, заставив бедных студентов-четверокурсников учиться с обеда и до самого вечера?! У меня был ответ на этот вопрос: наверняка кто-то, кто не мог похвастаться особым умом. Впрочем, тогда, сидя на скучной паре, я еще не знала, что благодаря этому альтернативно одаренному, составившему именно такое расписание, я встречу человека, который сможет изменить мою жизнь и меня саму.

Тогда я вообще ничего не знала – ни неприятностей, ни печалей, ни странных, порою абсолютно нелепых и смешных ситуаций.

И любви тоже не знала.

Я считала, что такие, как я, не умеют любить. Ведь для ведьм любви не существует (и пусть ведьма я всего лишь из-за фамилии «Ведьмина»; меня с детства так называли, а я никогда не была против).

В какой-то момент голос преподавателя окончательно убаюкал меня, и я не заметила, как закрыла глаза и провалилась в зыбкий сон. Мне снилось, что я иду по заснеженной темной дороге, в лицо дует холодный ветер и бьет снег, и мне проще повернуть назад, чем идти дальше, но я иду, иду и иду, точно зная, что в конце этой сложной дороги меня ждет особенный человек. Подняв голову, я вижу его. Он стоит, скрестив на груди руки, высокий, подтянутый, широкоплечий. И изо всех сил бегу к нему, потому что только с ним я смогу согреться. Но оказавшись рядом с ним, я вздрагиваю от ужаса: у особенного человека лицо того самого престарелого преподавателя, читающего лекцию.

«Иди ко мне, моя любимая студенточка», – сказал он и протянул ко мне руки, чтобы обнять. И я, вздрогнув, проснулась.

Господи, привидится же такое! Любимая студенточка, фу! Как вообще можно встречаться с преподавателем? Не хватает ровесников?

– Обязательно запомните, это важная информация, – задребезжал профессор, не зная, что только что посетил мой сон. – На зачете обязательно буду об этом спрашивать.

Он повторил материал, и я, зевнув, лениво сделала пометку в тетради. Остальные, кажется, вообще ничего не записывали. Хотя лекция и была потоковая, народу собралось совсем мало, человек тридцать от силы, и это при том что по списку должно было быть в пять раз больше. Я бы и сама с радостью прогуляла эту нудную пару, но приходилось посещать все лекции и то и дело бегать в учебный отдел: именно мне на далеком первом курсе выпало сомнительное удовольствие стать старостой, а заодно и совестью нашей группы бакалавров, теперь счастливо обучавшейся на последнем курсе экономического факультета. Кроме того, на меня была возложена великая честь отмечать присутствующих – некоторые преподаватели считали посещаемость крайне важной. Впрочем, другим, в число которых входил и продолжавший что-то бубнить профессор, было все равно.</p>
	<p>В какой-то момент я едва не заснула вновь, но тут рядом со мной за парту плюхнулась моя лучшая университетская подруга Женька и задорно зашептала, щекоча ухо своим дыханием:

– Эй, Татьяна, я тут такое видела!

– Что видела? – недовольно спросила я и бросила взгляд на наручные часы, тонкий кожаный ремешок которых обхватывал запястье. Еще полчаса. Господи, я не выдержу!

– Ваську видела! – сообщила Женька, кутаясь в куртку. Подруга была вся как огонь: рыжие вьющиеся волосы, румянец на щеках и искры в глазах. Я по-доброму завидовала ее кудряшкам, а она всегда говорила, что завидует моим прямым волосам. Все как обычно у девушек – кудрявые мечтают о прямых волосах, а те, у кого волосы прямые, – о вьющихся.

– Какого еще Ваську? – удивилась я.

Подруга закатила янтарные, с золотыми крапинками глаза.

– Какую, а не какого! – с напором выдала она. – Окладникову.

– Василину? – переспросила я.

– Ты совсем отупела, пока меня не было, – выдохнула Женька. – Естественно, ее.

– И что же ты такого увидела? – я покосилась на преподавателя. Нашего разговора он явно не замечал, продолжая монотонно что-то вещать. Остальные методично били баклуши.

– Ты не поверишь, – Женя пыталась держать интригу, не забывая улыбаться.

– Она тебе голый зад продемонстрировала и убежала? – я скептически посмотрела на подругу. – Мне звонить психологу, чтобы он восстановил твою хрупкую психику?

– Ой, Татьяна, да ну тебя с твоими шуточками. Ты знала, что у Васьки есть парень?

– Парень? —удивилась я. – И кто этот ненормальный?</p>

	<p>Василина Окладникова, о которой мы сейчас говорили, была моим старым недругом. Она училась вместе с нами на экономическом факультете, правда, на другой специальности. И хоть на лицо казалась симпатичной, да и фигуру, надо сказать, имела неплохую, характером не вышла от слова «совсем». Милая, приветливая, умеющая зажечь – просто душа компании, на самом деле Василина была той еще мерзостью с тонкими ножками и с жалкой шейкой, которую можно было переломить двумя пальцами. Я часто мечтала это сделать. И ласково называла ее Васькой. Как она называл меня, я могу лишь догадываться, но явно не Танечкой. Наша неприязнь была взаимной и глубокой уже много-много лет.

– Я его не знаю, – продолжала Женька, которая теплыми чувствами к Ваське тоже не пылала. – Но он ничего: высокий, темненький, мордашка симпатичная. В очках, правда, но ему идет. Так и хочется обратиться к нему «Сэмпай».

Я едва не закатила глаза. Евгения была заядлой анимешницей, а недавно увлекалась косплеем и вместе с каким-то местным косбэндом готовилась к фестивалю. Моя любовь к аниме так далеко не заходила, я предпочитала американские комиксы и даже собирала свою коллекцию, а еще обожала фильмы по «Марвелл» и «ДС».

– Сэмпай и Васька, – хмыкнула я, машинально начав рисовать на полях решеточки. – Отличное название для аниме-сериала. Уже вижу, какими будут серии: «Как я попался на удочку чудовища», «Потерянная свобода, или Романтическое рабство» и «Верните мне лучшие годы жизни!»

– Может быть, он в нее действительно влюблен, – хихикнула Женя. – Я их случайно заметила, они в таком уединенном месте стояли, будто специально, чтобы их никто не увидел. Пошла я в столовую…

– Ты же в туалет хотела, – перебила я подругу.

– И решила зайти попить купить, – махнула она рукой. – Так вот, захотела я срезать путь и пошла через колодец, в котором ремонт. Иду по второму этажу, смотрю – а внизу, под лестницей, они стоят и целуются. Я аж залюбовалась такая парочка милая, так страстно друг друга обнимают. Даже сердечко екнуло от умиления. А потом пригляделась – это же Васька с каким-то типом! – громким шепотом рассказывала мне Женька, личность чрезвычайно эмоциональная, шумная. веселая и простая. Я бы даже сказала, иногда простая, как табуретка, но с ней было спокойно, и не нужно было выглядеть лучше, чем я есть.</p>
	<p>– И что, долго ты подсматривала?

– Неа. Пошла в столовку. Зато когда шла обратно, они уже не целовались. Он говорил ей что-то, а она плакала, – прошептала подруга, убирая за ухо непослушную огненную прядь.

– От счастья? – хмыкнула я.

– Откуда мне знать? – Женька беспечно пожала плечами.

– Может быть, от его поцелуев девушки сразу улетают на седьмое небо?

– Прости, я не спустилась к ним и не спросила, что он там умеет, а что нет. Но Васька точно не от счастья ревела. Вдруг он в армию уходит, вот она и ноет?

– Ага, на флот, подводником, – иронично заметила я. Новость о том, что у той, кого я терпеть не могла, появился молодой человек, заинтересовала. Я никогда не питала к Василине Окладниковой нежных чувств, а с недавнего времени так и вовсе стала искать уязвимые места. Может быть, это мой шанс?

– О чем они говорили?

– Извини, со второго этажа слышно не было, – фыркнула Евгения. – Васька стояла, опустив голову, а парень положил ей руки на плечи, вот так, – она повторила жест незнакомца, с размаху шлепнув мне на плечо ладонь с растопыренными пальцами. – А потом взял ее за…

– За волосы? – перебив, полюбопытствовала я. – Скальп хотел снять?

– За подбородок и…

– Челюсть оторвать хотел?

– Ведьмина! – не выдержала Женька. – За подбородок он ее взял и голову приподнял. Чтобы в глаза заглянуть! Вот так!

И она показала на мне это движение, глядя в лицо нарочито вытаращенными глазами, приподняв брови и сложив губы «уточкой». Я с трудом сдержалась от смеха:

– Романтичненько. Если при этом «сэмпай» так смотрел на Ваську, я понимаю, почему она плакала.

– Вы чего делаете, девчонки? —нас в спины потыкал ручкой одногруппник, питавший, как я давно заметила, определенно теплые чувства к Женьке. Звали его Илья, и этот Илья таскался за нами хвостиком, всячески пытаясь привлечь внимание подруги. Та не привлекалась. Ей куда больше нравились парни не реальные, а нарисованные. Илья страдал, но не отступал.</p>
	<p>– Драму разыгрываем, – ответила я шепотом.

– Мне уже можно ревновать? – заржал он.

– Тебе можно идти к черту, – любезно разрешила я.

– Возьмите меня к себе третьим, – не отставал Илья. – Будем модными. Любовь на троих, все дела.

– Идиот, – прошипели мы с Женькой одновременно. Я хотела наградить его еще каким-нибудь нехорошим словечком, однако, заметив, как посмотрел на нас лектор, сочла за лучшее отвернуться.

– Интересно, что между ними произошло? – спросила Женька задумчиво. – Жаль, я не взяла с собой телефон, а то сняла бы их на камеру.

– Что бы ни произошло, я узнаю, – хищно пообещала я. Я знала про свою врагиню все, а вот про парня мне ничего известно не было. И когда только Васька успела его завести? Интрига вечера.</p>

	<p><h1>Глава 2</h1></p>
	<p>В этот раз старенький профессор не стал держать нас до конца лекции, а, назвав список литературы, с которой настоятельно рекомендовал ознакомиться к зачету, отпустил на пятнадцать минут пораньше.

Измученные студенты тотчас повалили к дверям, на ходу одеваясь и закидывая на плечи рюкзаки. Шестая пара оказалась утомительной. Женька тотчас унеслась домой доделывать лабораторную работу, о которой она благополучно забыла, следом за ней побежал и Илья, обещавший помочь, а я направилась к стоянке в компании наушников.

На улице было темно и холодно (впрочем, чего еще ждать от ноября с его первыми морозами и порывистыми ветрами?), однако мне все было нипочем: дорогие родители подарили машину. Новенькая алая, как кровь, малышка из славного семейства «Хендай», ждала меня на стоянке неподалеку от университетского корпуса, и я, цокая каблуками, спешила к ней, бережно держа в руках ключи.

Честно говоря, дом мой находился недалеко от университета, всего лишь в нескольких остановках на автобусе, но я предпочитала ездить на машине. Не потому что хотела показаться крутой или произвести на кого-то впечатление, а потому что мне очень уж нравилось находиться за рулем, чувствуя скорость и понимая, что управление полностью лежит на мне. И что это я, а не кто-то другой, заставляю машину двигаться.

С тех пор как в прошлом году я сдала на права, вождение стало моим антидепрессантом. И я уже воспринимала Малышку не как машину, а как верного красного механического коня, или, лучше сказать, пони, потому как габариты у Малышки были небольшие – чисто женская машинка, яркая и элегантная. Водительский стаж у меня был скромным, и я все еще побаивалась ездить по городу с его нескончаемыми пробками, однако путь от университета до коттеджного поселка, где я жила, был недолгий, а трасса – хорошей. Самое то для начинающего водителя.

Наслаждаясь морозным воздухом, я шагала по аллейке, громко стуча высокими каблуками. Падал снег. Он невесомыми перьями оседал на лапах елей, высаженных вдоль массивного корпуса, легким покрывалом ложился на замерзшую землю с остатками пожелтевшей травы, игриво путался в волосах и беззвучно таял, попадая на лицо или руки. Снег всегда поднимал мне настроение, даря предчувствие сказки и предвкушение скорого праздника. До Нового года оставалось немногим больше месяца. Пора было придумывать, что подарить домочадцам и друзьям.

Кажется, Женька хотела кугуруми, и у меня еще есть время заказа…

С этой мыслью я споткнулась, не заметив на своем пути палку, и, перелетев через невысокий бордюр, упала прямиком под ближайшую елку.

– Сволочь! – от души выругалась я, сидя на земле и вытаскивая из волос какую-то ветку. Сволочью, разумеется, была коварная палка. Попалась же мне под ноги, а!

Приземление было довольно мягким, и я не ударилась, но телефон вывалился из рук и затерялся где-то в сухой траве, припорошенной снегом. Хорошо еще, что свидетелей моего позорного падения не оказалось – так поздно в субботу учились только мы.</p>
	<p>– Чтоб тебя, – злобно прошептала я, а потом пожелала проклятой палке переломиться и, спешно отряхиваясь, стала искать телефон. Поиски не сразу увенчались успехом, я облазила всю землю под парой елок, прежде чем отыскала телефон. При этом умудрилась порвать новенькие колготки. Как – ума не приложу. Когда я увидела телефон и цепко его схватила, подул ветер, и прядь моих длинных темно-русых волос зацепилась за еловую лапу. Пришлось распутывать. Несколько волос так и остались в иголках. Дурдом.

Я хотела было уже встать и отряхнуться, как вдруг услышала голос Васьки и притаилась. Не хотелось вылезать из-под елки при ней. Представляю, как это будет выглядеть: я лохматая, взъерошенная и вся в снегу. Вот Васька обрадуется. Лучше тихонечко переждать, чем позориться в глазах врага.

– Пожалуйста, подожди! – закричала Окладникова, и я с содроганием сердца подумала: а вдруг это она мне?!

– Олег, прошу! Олег! – ее голос стал громче, и я с облегчением выдохнула: кем-кем, а вот Олегом я себя никогда не считала.

– Олег! Остановись! Давай поговорим! – вновь крикнула Васька ему в спину. Я никогда не слышала в голосе Окладниковой столько мольбы.

Беги, Олег, беги! Иначе она тебя догонит, и тебе крышка.

Молодой человек, конечно же, не слышал моих мыслей, надо сказать, весьма здравых, и замер в нерешительности. Широкие плечи его дрогнули. И он все-таки обернулся. Василина подскочила к нему и, умоляюще заглянув в глаза, схватила за руки.

Меня, притаившуюся под елками, ни он, ни она, к счастью, не замечали.

– Ты не можешь так поступить! – говорила Василина, захлебываясь в своих чувствах, словно в воде, и хватая ртом воздух.

– Прости, – опустив лицо, тихо, но твердо сказал Олег. Тембр у него оказался приятный, глубокий, не то что комариный писк Окладниковой.

– Это неправильно… Не бросай меня, не бросай, – твердила она с мольбой.

– Мы не можем быть вместе. Прости меня. И отпусти. Это все, что я могу тебе сказать, – повторил Олег настойчиво. Голос его не был таким же жалким, как у Василины, но и веселым его назвать было трудно. Я лишь хмыкнула: думала, что это просто ссора, а они расстались. Забавно.

– Ты не можешь все разрушить! Не можешь, не можешь, не можешь!

– Разрушить то, что уже было разрушено, невозможно, Василина. Возвращайся в корпус. Заболеешь, – тихо и устало сказал Олег.</p>

	<p>– Ты же знаешь, что я люблю тебя! Почему ты так со мной? Почему?! – И Окладникова, не в силах больше контролировать себя, стала бить Олега по груди и плечам. Бить и рыдать. Я поежилась. Никогда не думала, что стану свидетельницей истерики Васьки. Даже толком злорадствовать не получалось.

– Василина, хватит, – Олег поймал ее за запястье. Ее имя прозвучало почти нежно. Меня едва не перекосило.

– Я тебя люблю! Прошу…

О чем там его просила Васька, мне так и не суждено было узнать. Олег вдруг поцеловал ее, коротко, горько, так, как целуют на прощание, и резко отстранился.

– Пожалуйста… – едва слышно прошептала Василина. Порыв ветра взметнул ее светлые длинные волосы.

– Я все решил. Иди обратно, иначе замерзнешь. Холодно. – Олег резко развернулся и зашагал к стоянке.

До меня донесся всхлип. А потом скрип снега под ногами Василины. Плача, она убежала в корпус. Олег же ни разу не оглянулся.

Переждав немного, чтобы меня никто не уличил в подслушивании, я вылезла из-под своей елки, отряхиваясь на ходу. Окладниковой и след простыл, а вдалеке виднелся высокий силуэт ее возлюбленного.

Бывшего возлюбленного.

Ох, горе-то какое! Бедная Васька, бросили!

Сочувствия у меня, однако, к ней не было никакого. Чужие расставания ее не волновали, так почему же я должна была переживать за нее? Недавно мою старшую сестру бросил жених. Перед самой свадьбой. И Васька сказала, что если кого-то бросают, то этот человек сам виноват, сам не смог удержать любимого. А ведь жениха моей сестры увела старшая сестра Васьки. Окладниковой не стоило говорить этого и…

И тут меня посетило озарение. На меня снизошло просветление. Я поняла!..

Вот он, мой шанс! Шанс отомстить сразу двоим! И Ваське, и ее сестричке!

В голове моментально сформировался план: вот я опутываю этого Олега своими чарами, вот он не в силах противостоять мне, и мы идем на свидание, а вот нас видит Васька, видит, и понимает, что ее Олежек теперь мой Олежек. Она заламывает руки, рыдает, глядя, как мы страстно целуемся… А еще лучше так: она видит, как он делает мне предложение, стоя на одном колене. Я смеюсь, запрокинув голову, и клыки мои сверкают в лунном свете, а рядом Васька молит о пощаде, а я говорю ей высокомерно: «Сама виновата, милочка, не смогла удержать. Ха!»

Ну ладно, последнее уже будет лишним. На вампира я похожа только красными от недосыпа глазами. Да и предложение от кого попало мне тоже не нужно, но вот посмотреть на перекошенное лицо Василины, когда она увидит, что ее любимый со мной, я бы не отказалась.

Сестра будет отомщена.

Я ускорила шаг, не собираясь упускать добычу. В тот момент я была совершенно уверена в том, что поступаю правильно. Не то чтобы я считала себя дланью господней, карающей идиотов, но восстановить справедливость хотя бы таким образом казалось верным решением.

Эй, Окладниковы, все возвращается сторицей!

На полупустую стоянку я едва ли не вбежала, боясь, что упущу бывшего Васькиного парня. И все же я успела. Олег обнаружился неподалеку от моей Малышки, он стоял около ухоженной темной машины. В одной руке у него был телефон. В другой – сигарета.

– Да, бабушка, – тихо говорил Олег. – Я приеду.

Я умилилась. Надо же. Бабушкин внучок.

– Хорошо. Не переживайте. Вам нужно больше отдыхать.

Боже, он что, бабушку на «вы» называет? Умора.

Он выслушал ее, вновь сообщил, что приедет и вежливо попрощался, а поднял голову, разглядывая черное небо, расшитое бледным узором звезд . Меня он не замечал, хотя я уставилась на него во все глаза, пытаясь хорошенько рассмотреть, благо в свете уличных фонарей могла это сделать.

Совершенно не в моем вкусе, но довольно неплох. Высокий, подтянутый, черноволосый, достаточно симпатичный – с приятными правильными чертами, высокими скулами, упрямым подбородком, гладкой светлой кожей и с глазами, спрятанными за стеклами прямоугольных очков в тонкой оправе. Было в его лице что-то строгое. Но не надменное, а гордое. А еще была усталость – и в жестах, и в выражении лица, и во взгляде, довольно-таки холодном, надо сказать. По-ноябрьски холодном.

И что Васька в нем нашла? Мой будущий парень был совершенно обычным, этакий типичный офисный работник. Я всегда любила в людях изюминку – во внешности или в характере, а он казался стерильным. Совершенно обычным. Никаким.

Холодный и пустой – таковы были мои первые впечатления об этом самом Олеге.

Ему снова кто-то позвонил – я услышала звук вибрации. И Олег тотчас ответил.

– Да, Стас, сделаю в понедельник, – сказал он отрывисто. – Сегодня нужно к семинару подготовиться. В воскресенье буду в научной библиотеке.



Недаром Женька назвала его «сэмпай»: проскальзывало в нем что-то такое наставительно-поучительное.

Так и представляю: Олежка приходит домой, аккуратно складывает вещи – носочек к носочку, переодевается в домашнюю пижаму с вертолетиками, старательно выглаженную бабушкой, и усаживается за разбор корреспонденции или за игру в шахматы с самим собой. А потом пьет липовый чай, читает Гете или Кафку в оригинале – или что там читают зануды? – и ложиться спать ровно в десять вечера.

Васькина любовь вдруг вопросительно посмотрела на меня, видимо, почувствовав пристальный взгляд. Я отчего-то занервничала, поняла вдруг: я не знаю, что сказать.

– Молодой человек, – сам собой открылся мой рот. – Вы не подскажете, где библиотека?

Более тупого вопроса и придумать было нельзя, и многие восприняли бы его за шутку, но Олег молча кивнул на серое здание напротив, в котором, судя по темным окнам, никого уже не было. Там действительно располагалась университетская библиотека.</p>
`;
const pageSize = 3; 
let currentPage = 0;
let pages = [];

function paginateText(text) {
	const paragraphs = text.trim().split('</p>');
	const pageCount = Math.ceil(paragraphs.length / pageSize);
	for (let i = 0; i < pageCount; i++) {
		const start = i * pageSize;
		const end = start + pageSize;
		pages.push(paragraphs.slice(start, end).join('</p>') + '</p>');
	}
}

function showPage(page) {
	bookContentElement.innerHTML = pages[page];
}

function prevPage() {
	if (currentPage > 0) {
		currentPage--;
		showPage(currentPage);
	}
}

function nextPage() {
	if (currentPage < pages.length - 1) {
		currentPage++;
		showPage(currentPage);
	}
}

document.getElementById('toggle-menu').addEventListener('click', function () {
	const sideMenu = document.getElementById('side-menu');
	if (sideMenu.style.display === 'none') {
		sideMenu.style.display = 'block';
	} else {
		sideMenu.style.display = 'none';
	}
});

document.getElementById('darkModeToggle').addEventListener('change', function () {
	document.body.classList.toggle('dark-mode');
});

document.getElementById('textSizeRange').addEventListener('input', function () {
	const bookContent = document.getElementById('book-content');
	bookContent.style.fontSize = this.value + 'px';
});

document.getElementById('brightnessRange').addEventListener('input', function () {
	const readerContainer = document.getElementById('reader-container');
	readerContainer.style.filter = `brightness(${this.value}%)`;
});

paginateText(bookText);
showPage(currentPage);