const bookContentElement = document.getElementById('book-content');
const bookText = `
	<p><h1>Генерал Дракона <br>Пролог 1</h1></p>
	<p>— Алисия, осторожнее, — услышав за спиной знакомый мальчишечий голос, лишь звонко рассмеялась и, задрав подол голубого платья до самых щиколоток, быстрее побежала вперёд по широкому поваленному бревну векового дуба на другую сторону узкого ущелья.

Подо мной, разинув пасть, белела ледяными водами горной реки пропасть.

Такая глубокая, что голова кружилась.

Острые скалы торчали из воды словно зубы дракона.

Смотреть вниз всегда было так страшно, что ладошки потели.

Добравшись до каменистой земли, развернулась и, подняв руки вверх, весело покружилась, показывая, какая я смелая.

Бесстрашная. И вообще самая-самая.

— Вот видишь, Фроди, не только драконы сильные и ловкие, но и маги тоже!

— Да куда вам до нас, — мой лучший тайный друг ловко вскочил на бревно, а потом, красуясь, вдруг подпрыгнул и встал на руки. И вот так весело болтая ногами в воздухе, преодолел весь путь.

— Позёр! — фыркнула я на него. — Вы мальчишки вечно красуетесь.

Мне стало обидно. Всегда он выставляется.

— Это какие такие мальчишки? — Фроди встал на ноги и упёр руки в бока. — Я же у тебя единственный друг. Самый лучший и любимый!

Поджав губы, он зыркнул на меня из-под длинной чёлки.

— Фи... — я задрала нос, — у меня, как у старшей наследницы рода, много ухажёров, — мечтательно вздохнув, я поймала выбившийся из строгой причёски тонкий светлый локон и принялась наматывать его на палец. — Вот исполнится через три года одиннадцать и мне даже разрешат наблюдать за тем, как взрослые танцуют на балу. Я буду вальсировать на верхней площадке. Возможно, даже с мальчиком.

Поставив руки как надо, я обняла несуществующего партнёра и принялась танцевать, поглядывая на землю.

Все не могла запомнить, с какой ноги делать первый шаг.

— Ой-ой-ой, — Фроди подпрыгнул ко мне и, схватив за талию, повёл в танце. Да так ловко, что хотелось наступить ему на ногу.

Но я же воспитанная.

Я же лера лана Матей.

— Алисия, а знаешь... Да, я всех своих соперников одной левой, — Фроди важно задрал подбородок. —  И у драконов можно появляться на балах и вечерах с пелёнок.

— Глупости, это неправильное воспитание, — фыркнула я. — Вы, драконы, не знаете манер.

— Всё мы знаем, девчонка, — подняв меня за талию, он покружил в воздухе. — Просто вы, маги, чопорные и напыщенные.

— Я не напыщенная, — визжала я смеясь.

— Конечно, нет, а вот твой братец — да, — Фроди поставил меня на невысокий пенёк. — Я познакомился с ним вчера. Твой отец приезжал к нам в поместье.

— А зачем?

— Купить его хотел, ты разве не слышала — война скоро.

— Моя няня говорит, что глупости это всё, — тут же возразила я.

— Не глупости, Алисия, — взгляд его всегда весёлых зелёных глаз потух. — Маги заявили, что это их континент. А драконы не стерпят.

— А я говорю: не будет войны! — сложив руки на груди, я нетерпеливо топнула ногой. — Вам бы мальчишкам только повоевать. Брат такой же — носится со своим мечом по коридорам. Играть не даёт. А вчера вообще забрал мою любимую куклу и зарубил её на улице. Я так плакала, когда няня ей голову пришивала обратно.

Вспомнив, как отбирала у братца голову своей любимой тряпичной куклы, а он, издеваясь, пинал ее вредным младшим сестрицам, зло засопела. Ладно этот черствый мальчишка. Ему бы только показать, что он хоть и младше меня, а все же наследник. Но эти две мелкие пакостницы... Сестры не упускали случая, чтобы насолить мне, довести до слез.

Близняшки были невыносимы.

Даже порой взрослых не слушали. А это в моем понимании было верхом невоспитанности.

— Дурак он, брат твой. Нельзя сестер обижать! — тут же встал на мою сторону Фроди. — Я бы ему наставил тумаков.

Он воинственно потряс кулаком в воздухе.

Взглянув на него, хмыкнула. Да, Фроди, мальчишкой был неслабым. Грязным, правда, немного, но няня бы его отмыла и чёлку бы подстригла. А то его волосы цвета теплого шоколада вечно свисали сосульками, закрывая лицо.

Мне, как лере, было важно, чтобы жених выглядел опрятно, выглажено и... Причесан еще.

А Фроди... Эх, такое безобразие.

И это сын крупного землевладельца!

Наш лан соседствовал с землями драконов. Граница проходила здесь рядом и с моего окна в замке хорошо был виден огромный коттедж, в котором и жил мой будущий жених. Вот подрасту еще немного и сплету ему такой венок... Всем на зависть. Или браслет. Да! Из цветных шнурков. Чтобы ни у кого такого больше не было. </p>
	<p> Фроди, а если будет война — вы уедете, да? — прошептала я, вдруг поняв, что могу потерять любимого друга.

— Конечно, — он важно кивнул и смахнул с лица челку. — Мой отец один из лучших воинов императора. Он генерал!

— А раз генерал, — прищурилась я, — то почему земля не ваша?

— Она наша! — возмутился Фроди. — Просто у нас традиции не как у вас. Вся земля принадлежит императору! А тем, кто ему верно служит, дается право строить дома и возделывать её. У нас родовые общины. И главный в семье — мой дядя. Именно ему и принадлежит замок. А мы селимся по кругу, чтобы защитить родовое гнездо.

— Но, если война вы улетите?

— Да, обернёмся и отправимся в столицу. Вытащим мечи и пойдём на врага...

— Маленький ты еще, Фроди, и все тут, — я топнула ногой, чтобы придать вес своим словам.

— Неправда, вот смотри, — он вытащил из ножен деревянный меч и рубанул по ветке, но она не обломилась.</p>

	<p>Засмеявшись, я показала ему язык.

— Ах ты вредная, лера, — он затряс кулаком. — А ну, иди сюда. Я сейчас как дерну тебя за медовые косички. Вот увяжется за тобой пчела — не буду ее отгонять. А пчелы любят девочек с волосами цвета липового меда. Особенно, когда от этих чистеньких лер цветочками пахнет.

— Фроди, — возмутилась я. — Не говори так! Ты спасешь меня от любой пчелы. Но все равно ты еще не большой, а маленький. Рано тебе воевать.

— Чтобы вы понимали, девчонки, — нахмурившись, он уселся на трухлявый пень. — Я рожден, чтобы стать самым сильным генералом армии императора. Но без войны — это так долго.

Поморщившись, я подошла к нему и уселась рядом.

Солнце высоко поднималось над горизонтом припекая.

Мы сидели на пне и думали каждый о своем.

— Фроди, — не выдержала я молчания. — Но если ты улетишь, то как же мы поженимся, когда вырастим?

— Как-как, легко! — отмахнулся он. — Я прилечу за тобой, а ты будешь мне писать, пока мы в разлуке.

— А куда писать-то?

— Ну, я конечно передам тебе свой брачный браслет и вложу в него записку с адресом. Ты же умная, проберёшься к отцу в кабинет, напишешь на конверте нужные строчки и подсунешь к его остальным письмам. Сможешь же?

Призадумавшись, я вспомнила, сколько отец пишет писем за неделю.

Коробка целая! Она всегда стоит открытой в его кабинете и не проверяется.

— Смогу, — я уверенно кивнула. — А браслет свадебный?

— Конечно! — Фроди довольно растянул губы в улыбке. — Его уже давно сплели. Он у отца в кабинете хранится, но отдать его он должен в день совершеннолетия, когда мне поменяют имя. А это ещё так не скоро. Замучаешься ждать. Мне будет аж двенадцать, когда дядя, собрав всю семью, вручит мне самый лучший и острый меч, браслет и назовёт перед всеми истинным именем. Быстрее бы уже.

— Ого, — я поймала кончик косички и накрутила на палец. — А чем Фроди плохо быть?

— Это имя дала мне матушка, оно для ребенка, но не для воина, — терпеливо объяснил он. — Но раз ты считаешь, что я еще маленький, то и браслета пока не будет.

— Да большой ты. Большой... — согласилась я, меня сейчас другое озаботило. — То есть я стану женой не Фроди, а кого-то другого? — всплеснув руками, представила весь масштаб трагедии. — Подумать только. А я ведь уже вышила на носовом платочке твоё имя! Придумала узор для каждой буковки. Столько вариантов перепробовала. И что? Мне перешивать теперь все?!

— А зачем мне на платке имя? — его бровь слегка приподнялась.

— Как это зачем?! — фыркнув, покачала головой. — Это же приданое. Приданое, Фроди! Что может быть важнее. И у меня, и у сестер будет по сундуку со скатертями, полотенчиками, платками. Это так важно! А ты имя менять... Нечестно так. Я же старалась, узоры на буквах выводила!

— Вы маги такие смешные, — этот невозможный мальчишка захохотал. — Что я жене ткани не куплю, что ли? И полотенец?

— Это важно! — Я сжала ладони в кулаки. — У каждой леры должно быть приданое! Строгий набор всего. Покрывало, подушки, платки, простыни, скатерти белые, скатерти цветные... И чтобы лера сама всё расшивала...

Он только захохотал громче.

— Не смейся, Фроди! — вскочив на ноги, упёрла руки в бока. — Каждая девочка-маг с пяти лет начинает готовить приданое. Учится шить, вышивать, вязать...

— Ты лучше готовить учись, — не дал он мне перечислить весь список того, что должна уметь лера. — Я поесть люблю.

— Ой, ну тебя! Ничего ты не понимаешь. Вымойся лучше и переоденься, у тебя на рубахе пятно грязи!

Он взглянул на свою одежду и довольно задрал подбородок. Как будто там было чем гордиться.

— Я на рассвете упражнялся на мечах, Алисия. А потом к тебе бежал. И вообще, я ещё вечером тренироваться буду. Вот перед сном и залезу в лохань. Может быть, если матушка погонит...

У-у-у, неряха!

Тяжело вздохнув, я возвела очи к ясному небу.

Ну вот как с ними, с мальчишками, быть? Ходят как поросята чумазые и ещё что-то о культуре говорят.

Немыслимо!

— Мой папа всегда ругает брата, если увидит хотя бы с пятнышком на одежде, — строгим тоном заявила я и снова демонстративно стрельнула взглядом на его светлую рубашку.

— Ну и глупый он, — Фроди не проняло. — Мужчина должен расти сильным, а не красивым! Твой брат весь напомаженный. Хилый. Какой с этого чистюли воин получится? Да никакой? Хотя... Нет, он будет красивым и надушенным. Всех врагов на поле боя поразит запахом своих зачёсанных набок волос. Они ахнут и падут на колени, покорённые дивным видом его начищенной до зеркального блеска кольчуги. Сложат мечи и устыдятся, глядя на пятна на боевых доспехах. Какой позор!

— Фроди, — я потрясла кулаком. — Мой брат — будущий лерд! Он не должен сражаться. Его предназначение...

— ... купаться в цветочных ваннах, — захохотал этот... грязнуля.

— Нет! — шмыгнув носом, я старалась говорить как наша домоправительница: громко, важно и растягивая слова. — Лерд обязан подавать пример своим подданным. Его внешний вид безупречен. Манеры отточены...

— Тогда мы легко вас победим, — опять перебил меня этот несносный мальчишка. — Нас отточенным клинком брать надо, а не манерами. Но ты права, папа твой не мастер меча!

— Он маг! — от возмущения у меня раздувались ноздри. —  Мой отец самый мудрый и сильный. Он маг воздуха, как и я!

— Ну нет уж, маг стихий тут я!

Фроди откинул меч к камням и, встав в стойку, вскинул руки.

Поднялся ветер, по траве поползли листья. Над головой моего друга сформировался внушительный смерч. Кроны деревьев жалобно затрещали, могучие стволы зашатались. А воронка все поднималась и уходила в небо. Высоко-высоко. Где-то на другой стороне ущелья тревожно закаркали вороны. И вдруг вращающийся вихрь обратился в яростное пламя. Тонкие веточки ближайших деревьев вспыхнули и осыпались пеплом.</p>
	<p></p>
	<p></p>

	<p> Ой-ой. Завоюет он. Маги сильнее драконов. И папа мой несокрушим. Он меня любит, я же его первенец. Он ещё подумает, отдавать ли меня за тебя.

— Ха, отдаст, — подойдя к огромным валунам, он поднял свой короткий деревянный меч. — Потому как земля эта будет моей.

— Нет! — я уперла руки в бока. — Род Матей состоит из сильных магов.

— Да, Алисия. Твой папа задирает моего. Требует отдать ему нашу землю без боя. Ведёт себя оскорбительно и обзывается, называя нас ящерицами. Это недостойно!

— Мой папа не такой, — насупившись, я задрала подбородок.

Не любила, когда Фроди говорил плохо о членах моей семьи. Делал он это нечасто, но иногда его слова были просто недопустимыми.

— Такой, Алисия. И брат такой. Пока наши отцы разговаривали, он вышел во двор и сломал шалаш моего младшего брата. Взял и ногами поломал все ветки, на которых он держался. Разве достойный воин себя так ведет? Это подлость! Обижать маленьких низко. А тем более пакостить, когда взрослые не видят. Он слизняк! Ты вообще на него непохожа. Ни на кого из них. Ты очень добрая, хоть порой и вредная. По нашим законам наследницей рода была бы ты, а не он. Потому что неважно мальчик или девочка. Власть у первого ребёнка в семье. И когда я приду на эту землю, то законы магов потеряют силу. Наследницей станешь ты, и мы объединим наши семьи.

— Нет, мой папа победит. Он у меня самый сильный маг, — пробубнила я упрямо.

От его слов мне стало совсем грустно, потому как мой брат Критес и правда часто пакостил. Ломал игрушки или, извозив палку в лужах для свиней, тыкал ею в мои платья, зная, как я не люблю грязь. 

Да и близняшки не сильно от него отличались.

Усевшись на толстый корень дерева, растущего на краю скалы, насупилась.

Конечно, мой папа не замечал меня, ведь я всего лишь девочка. К тому же у меня подрастали ещё две сестры. Но я его любила и гордилась им. Он же папа! Лерд этих земель. И обидно было, что Фроди не уважает его.

Все должны уважать папу.

— Алисия, ты что обиделась?

Шмыгнув носом, сложила руки на груди.

— Хочешь, я достану тебе с вершины голубой цветок?

— Тебе нельзя обращаться драконом. Увидят, поругают. Это наши земли.

— Да я так достану.

Подскочив к скале, он ловко принялся карабкаться наверх.

— Осторожно, — мне стало страшно за этого безрассудно-храброго мальчишку. — Упадешь и коленки разобьёшь.

— Для настоящего дракона синяки и ссадины украшение! — донеслось до меня сверху.

— Настоящий лерд должен выглядеть чистым и опрятным!

— Под чистыми штанами моих коленей не видать.

Задирая голову, я пыталась рассмотреть Фроди за ягодными кустами.

Голубые снежные примулы росли только на голых скалах, там в вышине. Любая девочка мечтала покрасоваться в венке из таких цветов. Но мне было нельзя. Разве что цветочек в тугую косичку вставить.

Фроди порой доставал мне примулы и даже венок из них я плела. Но оставляла здесь, вешая на ветку. Если бы меня в нем увидели в замке, то принялись расспрашивать откуда цветы. Особенно навязчивым и вездесущим был брат. И не докажешь ему, что это я сама их нашла. Не поверит.

Да и про Фроди я молчала.

Проносила в волосах редкие цветочки и прятала их в комнате.

Жаль, они быстро вяли.

— Нашёл! — прокричал мой друг.

Несколько камушков скатилось по склону, напугав меня.

— Не упади, — совсем неприлично закричала я. — Фроди, возвращайся. Ты упадёшь.

— Ты что в меня не веришь?! Я же дракон. Будущий генерал императора.

— Ты ещё маленький и можешь упасть.

— Я не маленький, а уже взрослый. Ясно тебе? — его голос звучал ближе.

Снова посыпались мелкие, но острые камни. Они отскакивали от земли и откатывались в сторону. Сделав еще один шажок назад, подняла голову. Мой друг показался за пышным кустом скальной черной ягоды и снова скрылся в неглубокой расщелине.

Вновь посыпались мелкие камешки.

Вдруг... грохот...

Фроди, неуклюже съехав по крутому склону, уселся прямо передо мной, смешно расставив ноги. Потирая ушибленное то, что пониже спины, чего-то бормотал себе под нос. Явно неприличное! Не удержавшись, я хрюкнула со смеху.

— Вот видишь, как девочек не слушать, — обличительно ткнула в него указательным пальцем. — А я говорила, осторожнее. Но разве вы, мальчишки, когда кого слушаете?!

Он поморщился, и обиженно взглянул на меня.

— Я же тебе хотел цветок принести, а ты смеешься...

— А вот и не говори, что самый сильный. Вырасти сначала.

— Да ну тебя, — он вручил мне немного помятый голубой цветок и поднялся на ноги. — Невесты драконов не смеются над своими женихами!

— А ты моей руки ещё у папы не просил, — подметила я и поднесла цветок к лицу.

Как он пах! Сладкий аромат напоминал о леденцах, что готовили детям на праздники. О ярких оранжевых петушках, которые отливали из сладкой карамели.

Переведя взгляд на друга, мило улыбнулась и вставила цветок в косичку.

— А что просить, — Фроди отвернулся от меня. — Он же выгонит только потому, что я дракон! Мы же для вас ящерицы!

— Это неправда! — как же мне не понравились его слова. — Я уважаю тебя и.… люблю.

— Но ты смеешься надо мной!

— Это потому, что ты меня не послушался и упал.

— Тогда иди и скажи брату и отцу, что дружишь с драконом.

Фроди указал в сторону виднеющегося за холмом замка.

И я трусливо отступила на шаг.</p>
	<p>— Не могу, — поджав губы, отвернулась. — Они ругать будут!

— Так кто из нас трус, Алисия? Я, который ради тебя разбиться не побоялся, или ты, стесняющаяся нашей дружбы? Я своему отцу ещё два года назад сказал, что подружился с девочкой из-за реки. И он очень рад был, а ты всё молчишь и бегаешь сюда как заяц.

— Мне только восемь! Мне нельзя выбирать самой, с кем дружбу водить и по скалам бегать за кроликами. Папа меня просто запрет, и всё. Тогда мы с тобой не увидимся больше.

— Ничего, я получу свой меч и завоюю право сделать тебе предложение. Когда ты вырастешь, то станешь моей женой и Великий дух драконов принесет нам яйцо с первенцем…</p>
	<p></p>

	<p>— Сам высиживай свое яйцо, — пробурчала я.

— Ничего вы маги не понимаете. Раз ты такая вредная, то не приду больше, пока отцу не признаешься, — он разозлится.

Вернув свой меч в ножны, Фроди, подпрыгнув, уцепился за толстую ветку дуба, под которым стоял, и повис, раскачиваясь взад-вперед. Затем, подтянувшись, и вовсе залез на нее и свесил ноги.

Мне тоже захотелось на дерево, но в платье лезть... Порву, да и негоже лерам, как кошкам по веткам скакать. Но так хочется...

— Не могу я, Фроди, быть как ты, — пробурчала я. — Папа меня накажет, а няне Валенсии даст строгие указания следить за мной в оба глаза и не выпускать за пределы замка. И закончится моя счастливая вольная жизнь. Если он узнает о тебе — разозлится и сильно!

— Ну и что, — в зеленых глазах моего друга вспыхнуло пламя и тут же погасло, словно он взял магию под контроль. — Зато он перестанет искать тебе женихов. Я видел твою миниатюру в шкатулке невест!

— Папа не ищет мне партию, — неуверенно пробормотала я.

Ну мне во всяком случае, об этом не сообщала няня. Хотя мой маленький портретик действительно был написан господином магом-художником еще месяц назад. Папа заплатил целый мешочек золотом, чтобы мастер смог передать мой образ так, чтобы он менялся с годами. По мере моего взросления.

— Он ищет, Алисия, — в голосе друга звенела настоящая злость. — И хочет выгоднее замуж отдать, чтобы эти земли укрепить. А пока ты маленькая, хотя бы помолвку заключить. Знаю я этих взрослых. Им бы лишь бы золото в кармане звенело. Так что сознавайся ему.

— Помолвку?! Ой, это несерьезно, — я деланно махнула рукой. — Замуж ещё, ой, как рано и я всегда могу отказать. А когда стану большой — просто сбегу с тобой.

— Что! Я не желаю, как вор утаскивать невесту. Это стыдно! — его лицо сделалось обиженным и оскорбленным, как будто я ему стащить единственного осла старенького господина храмовника предлагаю. — Сжалься, лера! Я и так стащил твою миниатюру!

— ЧТО? Фроди как ты мог, это же ... Это...

— Ага, как же, — продолжал возмущаться он. — Оставь я ее там, наверняка, уже бы набежали женихи. Что я дурак соперникам шанс оставлять? И папа мой сказал, что я все правильно сделал. Воин сражается за девочек, а не ворует их. Тьфу!

— Фроди, — я покачала головой, представив, что скажет папа, если узнает, что моя миниатюра пропала. А если начнет выяснять что к чему? И не приведи богиня Матушки земли, он прознает про моего друга. Про это место.... Это кошмар!

— Все ведь так просто, Фроди, ты меня своруешь и все, — жалобно пропела я и хлопнула ресничками три раза так же, как делали мои сестры, когда выклянчивали у отца платьица и кукол.

— Не буду воровать! — категорично заявил он и сложил руки на груди. — Генералы не воруют!

— Ну и не воруй! — обиделась я. — И вообще, мне пора на обед! А ты сиди тут без невесты.

Развернувшись, я гордо прошлась до бревна.

Не хочет он побег устраивать!

Это же так романтично.

Я мечтательно вздохнула.

Ничего эти мальчишки не понимают. Я уже всё спланировала, только не знала, как сундук с приданым за собой утащить. Оставлять ведь никак нельзя. Неприлично! Лера и вдруг без набора нужных для жизни вещей. Как же в браке и без новых подушек, без скатертей, без платочков. Даже думать не хочу об этом. Сундук надо брать с собой. Но это ведь дело решаемое. Перекинется Фроди драконом, а я ему сундук сброшу с балкона на горб — поймает.

Он же сильный. Генерал!

Вот и пусть тащит все на себе!

Чем не вариант!

— Алисия, — Фроди спрыгнул с ветки и поймал меня за руку, — Не дуйся ты. Для дракона пленить девочку — это бесчестие! Невеста должна гордиться своим женихом. Не стесняться его. Вечером сюда придешь? Наша кухарка с утра печет булочки.

— С маком? — услышав заветное слово, я разом подобрела.

— Твои любимые, — он закивал, — специально для тебя испечь попросил. Драконы душой чувствуют, что хотят их избранницы.

— Тогда приду, — вздохнув для пущего эффекта, согласилась я. — И это я тебе про булочки сказала. Ничего ты там не чувствуешь!

— Вредина! А отцу расскажешь обо мне? — в его глазах снова появился этот странный огонек.

Как будто там в их глубине бушевала ярость.

— Нет, — тихо пробормотала я. — Мы сбежим.

— Не хочу я сбегать! — он всплеснул руками. — Чем я жених недостойный? Чего он твою миниатюру всем показывал? Ты же моя невеста.

— Я не хочу, чтобы папа на меня злился!

— Маленькая трусишка!

— Не обзывайся! Лерды себя так не ведут.

— А я дракон! Драконы ведут себя так, как хотят. И говорят, что думают!

— Говорить, что думаешь, недопустимо! — быстро показав ему язык, я ступила на шаткое бревно и осторожно перешла на другую сторону.

— Алисия! — прокричал Фроди с той стороны ущелья. — Я не стану сбегать! Завоюю эту землю и лишу твоего брата-хиляка права наследования. А ты станешь моим трофеем!

— Глупости, — развернувшись громко произнесла я. — Маги сильнее драконов.

— Я стану генералом! Запомни это. А ты, лера Алисия Матей, — мой трофей! Вот так!

— Фи...!  Ну хорошо, — я мило улыбнулась, как учила меня няня, — стань им, и я тогда всё расскажу папе.

Впереди странно затрещали кусты, и послышался звук ломающейся палки.

Испугавшись, я замолчала и завертела головой. Треск повторился только правее.

— Кто здесь? — я отступила к бревну. — Фроди, там кто-то есть! Фроди!

Услышав меня, он быстро перебежал по дереву и остановился. Из-под высоких зарослей травы выскочил перепуганный заяц.

— Ну ты и трусиха, — тихо засмеялся этот несносный дракон. — Зайчика испугалась.

— Неправда, я смелая. И ветки трещали...  Все я ухожу! Булочки не забудь!

Расправив плечи, я поспешила к замку, видневшемуся за холмом.

Солнце стояло прямо над головой, освещая зеленые равнины родного лена.</p>
	<p></p>
	<p></p>

	<p>Поднявшись на пологую вершину, взглянула в сторону океана. Там между высоких неприступных скал возвышался наш замок. Три яруса. Четыре башни с балконами. Высокая каменная стена. На заднем дворе площадка, на которой воины оттачивали свое мастерство ведения боя. Правда, там все больше разгуливали местные курицы, и если уж и наблюдались поединки, то петушиные.

Одну из мишеней лучников, самую высокую и вовсе аисты облюбовали, соорудив там себе гнездо. Там же в сторонке стоял скотный двор, амбары и сараи. Прачечная, выложенная из гладкого камня. Около нее всегда были лужи. Прачки мыльными камнями каждый день стирали наши вещи, развешивали их там же на длинных веревках. Порой туда забредали коровы и, цепляя на рога простыни да подштанники, утаскивали их в хлев. А то и вовсе жевать белье удумывали.

Я вздохнула, именно так пала смертью храбрых моя любимая ночная сорочка.

Ее нагло сжевал злобный бык Хруби. Да ладно бы куснул на один зубок, так он ее в грязь закинул и копытами изодрал.

Спасти уже не удалось, а она такая мягкая была, воздушная. Ее нянечка много лет берегла. Для меня хранила как память о маме.

А он ее изжевал и в грязь окунул!

Скотина рогатая да невоспитанная!

Я на праздник из вредности все котлеты из него съела... Отомстила хоть так.

Еще у нас была псарня и птичник.

Около восточной башни — голубятня.

А у северной — небольшой, но уютный сад. Правда, цветы там уже никто специально не садил. Они росли повсюду, нагло разрастаясь, где им только вздумается. Дорожки покрылись слоем земли и скрылись из виду, проглядываясь кое-где белыми камнями. Слуги протаптывали новые тропинки, поэтому они не петляли, а всегда быстро приводили в нужную часть сада.

Кое-где поварята весной высаживали пряные травы и овощи. Лук, чеснок, горох, бобы, щавель.

Вот так жил замок рода Матей!

У центральных ворот сегодня наблюдалось некое оживление. Во внутреннем дворике суетились воины отца. Смекнув, что если разузнаю в чём там дело, то смогу выкрутиться перед нянюшкой. С этой мыслью я понеслась вперед.

Спросит, где это я пропадала столько времени, а я ей — новости разведывала.

Она любила послушать, что в соседних ленах делалось. Заболтаю ее и не вспомнит, когда я в замок воротиться должна была.

Убрав из косички голубой цветок, чтобы не привлечь внимание братца, сжала его в руке и поспешила к столпившимся крестьянам.

Мужчины, женщины, дети... Все суетились у северной стены.

Шептались, тревожно переглядывались.

"Может казнь" — трусливо предположила я.

Но подняв голову, не увидела ни палача, ни осужденного, ни готовой петли.

Даже старых казненных убрали. А обычно забывали, и в итоге они падали прямо на землю. И это было ужасно!

Отсутствие палача успокоило. Да что там, словно от сердца отлегло. Не любила я смотреть, как людям больно делают. И хоть брат и говорил, что преступники они, и за дело их со стен с веревкой на шее скидывают, а всё одно страшно и жалко.

Пробравшись через толпу, я заметила одного из воинов отца. Добряк! И еще любитель с кухарками перемывать косточки жителям замка. Его часто можно было увидеть на кухне. Пока все сплетни выложит, пол копченого свиного окорочка сожрет.

Вот он-то мне и нужен.

— Ерь Кадифар, — неприлично закричала я и, дождавшись, пока он обернется на меня, как подобает присела в поклоне, расправив подол нарядного платья. — А почему народ собрался? Случилось, что в наших землях, уважаемый?

— Война, лера Алисия! — как-то непривычно строго ответил он. — Плохие новости. Беда. Поспешили бы вы в замок. Ваш отец собирает семью.

— Спасибо, ерь, — не задумываясь, пробубнила и, замерев на мгновение, обернулась на скалы.

Война!

Это значит, Фроди уедет вместе со своей семьей!

Зачем же я так рано ушла?

Зачем смеялась над ним? Обидела!

Развернувшись, я заспешила обратно на нашу небольшую поляну в ущелье, но тут же была поймана за руку. Кто-то больно сжал меня за предплечье.

— Ты где ходишь, Алисия? Я тебя уже час как ищу, — зашипел зло Критес, взирая на меня снизу вверх. — Отец приказал явиться в большой зал.

— Но мне нужно…

— Ты что глухая, сестрица? — его тонкие пальцы впились в мою кожу, делая больно. — Слово лерда — закон!

— Отпусти, — прошипела я, но он, не обращая внимания на мои сопротивления и не разжимая свои клешни, спешно тащил меня к большому крыльцу.

У-у-у, краб злобный!

Завидя нас, крестьяне расступались. На их лицах я видела лишь потерянность и страх.

И эти чувства странным образом передавались мне.

В большом зале было непривычно тихо. Завидя меня, нянечка подскочила с места и, отодрав от Критеса, увела к дальним креслам, где уже сидела Юола и Сафира — мои младшие сестры.

Их кормилица скользнула по мне строгим взглядом и задрала подбородок.

Я её жутко не любила, но она была подругой моей матушки и её молочной сестрой, поэтому после её смерти она взяла на себя заботу о маленьких сиротках.

Ну это она их так называла. По мне, так сестры близняшки были просто чудовищно избалованы и капризны.

Невыносимые забияки и поганицы.

— Ты где была? — тихо спросила няня Валенсия.

— Выясняла новости, — немного замявшись, я всё же соврала.

— Ой ли, что-то я тебя во дворе не видела, маленькая лера. А не обманываете ли вы часом нянечку свою?

Выпучив глаза, я облизнула губы.

— Нет, матушка, я леру Алисию видела своими глазами у южных врат, куда гонец прискакал, — неожиданно пришла мне на выручку молочная сестрица Талья. — Что ты, маменька. Куда же лере нашей еще бежать, как ни щенков смотреть или новости собирать?</p>

	`;
const pageSize = 3; 
let currentPage = 0;
let pages = [];

function paginateText(text) {
	const paragraphs = text.trim().split('</p>');
	const pageCount = Math.ceil(paragraphs.length / pageSize);
	for (let i = 0; i < pageCount; i++) {
		const start = i * pageSize;
		const end = start + pageSize;
		pages.push(paragraphs.slice(start, end).join('</p>') + '</p>');
	}
}

function showPage(page) {
	bookContentElement.innerHTML = pages[page];
}

function prevPage() {
	if (currentPage > 0) {
		currentPage--;
		showPage(currentPage);
	}
}

function nextPage() {
	if (currentPage < pages.length - 1) {
		currentPage++;
		showPage(currentPage);
	}
}

document.getElementById('toggle-menu').addEventListener('click', function () {
	const sideMenu = document.getElementById('side-menu');
	if (sideMenu.style.display === 'none') {
		sideMenu.style.display = 'block';
	} else {
		sideMenu.style.display = 'none';
	}
});

document.getElementById('darkModeToggle').addEventListener('change', function () {
	document.body.classList.toggle('dark-mode');
});

document.getElementById('textSizeRange').addEventListener('input', function () {
	const bookContent = document.getElementById('book-content');
	bookContent.style.fontSize = this.value + 'px';
});

document.getElementById('brightnessRange').addEventListener('input', function () {
	const readerContainer = document.getElementById('reader-container');
	readerContainer.style.filter = `brightness(${this.value}%)`;
});

paginateText(bookText);
showPage(currentPage);